AthenasArch/ESP32S3-CAN-OBD2-Firmware/lib/AthenasArch-ESP32_OBD2/src/athenasObd2.cpp
const char PERCENTAGE[] PROGMEM = "%";
const char KPA[] PROGMEM = "kPa";
const char PA[] PROGMEM = "Pa";
const char RPM[] PROGMEM = "rpm";
const char KPH[] PROGMEM = "km/h";
const char DEGREES_BEFORE_TDC[] PROGMEM = "° before TDC";
const char GRAMS_PER_SECOND[] PROGMEM = "grams/sec";
const char SECONDS[] PROGMEM = "seconds";
const char RATIO[] PROGMEM = "ratio";
const char COUNT[] PROGMEM = "count";
const char KM[] PROGMEM = "km";
const char VOLTS[] PROGMEM = "V";
const char MINUTES[] PROGMEM = "minutes";
const char GPS[] PROGMEM = "g/s";
const char DEGREES[] PROGMEM = "°";
const char DEGREES_CELCIUS[] PROGMEM = "°C";
const char LPH[] PROGMEM = "L/h";

const char *const PID_UNIT_MAPPER[] PROGMEM = {
    NULL,
    NULL,
    NULL,
    NULL,
    PERCENTAGE,
    DEGREES_CELCIUS,
    PERCENTAGE,
    PERCENTAGE,
    PERCENTAGE,
    PERCENTAGE,
    KPA,
    KPA,
    RPM,
    KPH,
    DEGREES_BEFORE_TDC,
    DEGREES_CELCIUS,
    GRAMS_PER_SECOND,
    PERCENTAGE,
    NULL,
    NULL,
    PERCENTAGE,
    PERCENTAGE,
    PERCENTAGE,
    PERCENTAGE,
    PERCENTAGE,
    PERCENTAGE,
    PERCENTAGE,
    PERCENTAGE,
    NULL,
    NULL,
    NULL,
    SECONDS,
    NULL,
    KM,
    KPA,
    KPA,
    RATIO,
    RATIO,
    RATIO,
    RATIO,
    RATIO,
    RATIO,
    RATIO,
    RATIO,
    PERCENTAGE,
    PERCENTAGE,
    PERCENTAGE,
    PERCENTAGE,
    COUNT,
    KM,
    PA,
    KPA,
    RATIO,
    RATIO,
    RATIO,
    RATIO,
    RATIO,
    RATIO,
    RATIO,
    RATIO,
    DEGREES_CELCIUS,
    DEGREES_CELCIUS,
    DEGREES_CELCIUS,
    DEGREES_CELCIUS,
    NULL,
    NULL,
    VOLTS,
    PERCENTAGE,
    RATIO,
    PERCENTAGE,
    DEGREES_CELCIUS,
    PERCENTAGE,
    PERCENTAGE,
    PERCENTAGE,
    PERCENTAGE,
    PERCENTAGE,
    PERCENTAGE,
    MINUTES,
    MINUTES,
    NULL,
    GPS,
    NULL,
    PERCENTAGE,
    KPA,
    PA,
    PERCENTAGE,
    PERCENTAGE,
    PERCENTAGE,
    PERCENTAGE,
    KPA,
    PERCENTAGE,
    PERCENTAGE,
    DEGREES_CELCIUS,
    DEGREES,
    LPH,
    NULL,
};

OBD2Class::OBD2Class() : _responseTimeout(OBD2_DEFAULT_TIMEOUT),
                         _lastPidResponseMillis(0)
{
    memset(_supportedPids, 0x00, sizeof(_supportedPids));
    _canMutex = xSemaphoreCreateMutex();
    _addrMode = OBD2_ADDR_11BIT;
    _baud = 0;
    _connected = false;   // NOVO
    _hbPid = ENGINE_RPM;  // NOVO
    _hbIntervalMs = 1000; // NOVO (1s)
    _lastHbMs = 0;        // NOVO
    _lastDetectMs = 0;    // NOVO
    _backoffMs = 1000;    // NOVO (1s)
    _backoffMaxMs = 8000; // NOVO (8s)
}

OBD2Class::~OBD2Class()
{
}

/// @brief
/// @return
int OBD2Class::begin()
{
    return begin(CAN_BPS_500K); // default
}

/// @brief
/// @param baud
/// @return
int OBD2Class::begin(uint32_t baud)
{
    if (!CAN0.begin(baud))
        return 0;

    memset(_supportedPids, 0x00, sizeof(_supportedPids));

    _useExtendedAddressing = false;
    CAN0.watchFor(0x7e8);

    if (!supportedPidsRead())
    {
        _useExtendedAddressing = true;
        CAN0.watchFor(0x18daf110);
        if (!supportedPidsRead())
        {
            _connected = false; // NOVO
            _baud = 0;          // NOVO
            return 0;
        }
    }
    // sucesso 11-bit
    _addrMode = OBD2_ADDR_11BIT; // NOVO
    _baud = baud;                // NOVO
    _connected = true;           // NOVO
    return 1;
}

bool OBD2Class::detectOnce()
{
    struct Try
    {
        uint32_t baud;
        Obd2AddrMode mode;
        const char *label;
    } tries[] = {
        {CAN_BPS_500K, OBD2_ADDR_11BIT, "11b/500k"},
        {CAN_BPS_250K, OBD2_ADDR_11BIT, "11b/250k"},
        {CAN_BPS_500K, OBD2_ADDR_29BIT, "29b/500k"},
        {CAN_BPS_250K, OBD2_ADDR_29BIT, "29b/250k"},
    };

    for (auto &t : tries)
    {
        bool started = (t.mode == OBD2_ADDR_11BIT) ? (begin(t.baud) == 1)
                                                   : startCan29bit(t.baud);
        if (!started)
            continue;

        delay(300); // estabiliza barramento

        float v;
        bool ok1 = readPid(PIDS_SUPPORT_01_20, v) || readPid(ENGINE_RPM, v);
        bool ok2 = ok1 && readPid(ENGINE_RPM, v);

        if (ok1 && ok2)
        {
            _connected = true;
            _addrMode = t.mode;
            _baud = t.baud;
            return true;
        }
        // falhou validação -> fecha e tenta próximo
        closeBus();
    }
    return false;
}

bool OBD2Class::heartbeatOnce()
{
    float v;
    if (readPid(_hbPid, v))
        return true;
    // fallback: só checar se responde algo
    return readPid(PIDS_SUPPORT_01_20, v);
}

void OBD2Class::setHeartbeatPid(uint8_t pid) { _hbPid = pid; }
void OBD2Class::setHeartbeatInterval(uint32_t ms) { _hbIntervalMs = ms; }
void OBD2Class::setBackoff(uint32_t initialMs, uint32_t maxMs)
{
    _backoffMs = initialMs ? initialMs : 1000;
    _backoffMaxMs = maxMs ? maxMs : 8000;
}

void OBD2Class::tick() {
    uint32_t now = millis();

    if (_connected) {
        // heartbeat normal
        if (now - _lastHbMs >= _hbIntervalMs) {
            _lastHbMs = now;
            if (!heartbeatOnce()) {
                closeBus();
                _lastReconnectAttempt = now; // marca falha
            }
        }
        return;
    }

    // só tenta reconectar quando atingir o tempo definido
    if (now - _lastReconnectAttempt >= _userReconnectIntervalMs) {
        if (detectOnce()) {
            _backoffMs = 1000; // opcional: reset
        }
        _lastReconnectAttempt = now;
    }
}


/// @brief
/// @return
int OBD2Class::beginAuto()
{
    struct Try
    {
        uint32_t baud;
        Obd2AddrMode mode;
    } tries[] = {
        {CAN_BPS_500K, OBD2_ADDR_11BIT},
        {CAN_BPS_250K, OBD2_ADDR_11BIT},
        {CAN_BPS_500K, OBD2_ADDR_29BIT},
        {CAN_BPS_250K, OBD2_ADDR_29BIT}};

    for (auto &t : tries)
    {
        if (t.mode == OBD2_ADDR_11BIT)
        {
            if (begin(t.baud))
            {
                _addrMode = OBD2_ADDR_11BIT;
                _baud = t.baud;
                return 1;
            }
        }
        else
        {
            if (startCan29bit(t.baud))
            {
                _addrMode = OBD2_ADDR_29BIT;
                _baud = t.baud;
                return 1;
            }
        }
    }
    return 0; // nenhum protocolo encontrado
}

void OBD2Class::end()
{
    //  CAN0.end();
}

