AthenasArch/ESP32S3-CAN-OBD2-Firmware/lib/AthenasArch-ESP32_OBD2/src/athenasObd2.cpp
    case FUEL_INJECTION_TIMING:
        return (((A * 256.0 + B) / 128.0) - 210.0);

    case ENGINE_FUEL_RATE:
        return ((A * 256.0 + B) / 20.0);

    default:
        return NAN;
    }

#undef A
#undef B
#undef C
#undef D
}


String OBD2Class::vinRead()
{
    char vin[18];

    memset(vin, 0x00, sizeof(vin));

    if (!pidRead(0x09, 0x02, vin, 17))
    {
        // failed
        return "";
    }

    return vin;
}

uint32_t OBD2Class::pidReadRaw(uint8_t pid)
{
    if (!pidSupported(pid))
    {
        return 0;
    }

#define A value[0]
#define B value[1]
#define C value[2]
#define D value[3]
    uint8_t value[4];

    if (!pidRead(0x01, pid, &value, sizeof(value)))
    {
        return 0;
    }

    switch (pid)
    {
    case COMMANDED_SECONDARY_AIR_STATUS:
    case OBD_STANDARDS_THIS_VEHICLE_CONFORMS_TO:
    case OXYGEN_SENSORS_PRESENT_IN_2_BANKS:
    case OXYGEN_SENSORS_PRESENT_IN_4_BANKS:
    case AUXILIARY_INPUT_STATUS:
    case FUEL_TYPE:
    case EMISSION_REQUIREMENT_TO_WHICH_VEHICLE_IS_DESIGNED:
        return (A);

    case FUEL_SYSTEM_STATUS:
        return ((uint32_t)A << 8 | (uint32_t)B);

    default:
        return ((uint32_t)A << 24 | (uint32_t)B << 16 | (uint32_t)C << 8 | (uint32_t)D);
    }
}

String OBD2Class::ecuNameRead()
{
    char ecuName[21];

    memset(ecuName, 0x00, sizeof(ecuName));

    if (!pidRead(0x09, 0x0a, ecuName, 20))
    {
        // failed
        return "";
    }

    return ecuName;
}

void OBD2Class::setTimeout(unsigned long timeout)
{
    _responseTimeout = timeout;
}

int OBD2Class::supportedPidsRead()
{
    for (int pid = 0x00; pid < 0xe0; pid += 0x20)
    {
        uint8_t value[4];

        if (pidRead(0x01, pid, value, sizeof(value)) != 4)
        {
            return 0;
        }

#define A value[0]
#define B value[1]
#define C value[2]
#define D value[3]
        _supportedPids[pid / 0x20] = ((uint32_t)A << 24 | (uint32_t)B << 16 | (uint32_t)C << 8 | (uint32_t)D << 0);

        if ((_supportedPids[pid / 0x20] & 0x00000001) == 0x00000000)
        {
            // no more
            break;
        }
    }

    return 1;
}

int OBD2Class::pidRead(uint8_t mode, uint8_t pid, void *data, int length)
{
    // make sure at least 60 ms have passed since the last response
    unsigned long lastResponseDelta = millis() - _lastPidResponseMillis;
    if (lastResponseDelta < 60)
    {
        delay(60 - lastResponseDelta);
    }

    CAN_FRAME outgoing;
    outgoing.id = 0x7df;
    outgoing.length = 8;
    outgoing.extended = 0;
    outgoing.rtr = 0;
    outgoing.data.uint8[0] = 0x02;
    outgoing.data.uint8[1] = mode;
    outgoing.data.uint8[2] = pid;
    outgoing.data.uint8[3] = 0x00;
    outgoing.data.uint8[4] = 0x00;
    outgoing.data.uint8[5] = 0x00;
    outgoing.data.uint8[6] = 0x00;
    outgoing.data.uint8[7] = 0x00;

    for (int retries = 10; retries > 0; retries--)
    {
        if (CAN0.sendFrame(outgoing))
        {
            // send success
            break;
        }
        else if (retries <= 1)
        {
            return 0;
        }
    }

    bool splitResponse = (length > 5);

    CAN_FRAME incoming;
    for (unsigned long start = millis(); (millis() - start) < _responseTimeout;)
    {

        if (CAN0.read(incoming) != 0)
        {
            _lastPidResponseMillis = millis();

            if (!splitResponse && incoming.data.uint8[1] == (mode | 0x40) && incoming.data.uint8[2] == pid)
            {
                for (uint8_t i = 0; i < length; i++)
                {
                    ((uint8_t *)data)[i] = incoming.data.uint8[i + 3];
                }
                return length;
            }

            // Is multiple packets
            if (incoming.data.uint8[0] == 0x10)
            {
                int read = 0;

                // Get first packet
                //////// Why only read three of the remaining six bytes in the first packet:
                //////// int read = CAN.readBytes((uint8_t*)data, 3);
                while (read < 3)
                {
                    ((uint8_t *)data)[read] = incoming.data.uint8[read + 2];
                    read++;
                }

                // Loop through rest of multiple packets
                for (int pck = 0; read < length; pck++)
                {
                    delay(60);

                    // send the request for the next chunk
                    outgoing.data.uint8[0] = 0x30;
                    CAN0.sendFrame(outgoing);

                    // wait for (proper) response
                    while (CAN0.read(incoming) != 0 || incoming.data.uint8[0] != (0x21 + pck))
                        ; // correct sequence number

                    // Something recieved
                    for (uint8_t i = 0; i < 7 && read < length; i++)
                    {
                        ((uint8_t *)data)[read++] = incoming.data.uint8[i + 1];
                    }
                }

                _lastPidResponseMillis = millis();
                return read;
            }
        }
    }
    return 0;
}

bool OBD2Class::startCan29bit(uint32_t baud)
{
    if (!CAN0.begin(baud))
        return false;
    CAN0.watchFor();             // aceitar todas respostas
    _addrMode = OBD2_ADDR_29BIT; // NOVO
    _baud = baud;                // NOVO
    // _connected será setado após validação numa leitura
    return true;
}

bool OBD2Class::send_pid_29(uint8_t service, uint8_t pid)
{
    CAN_FRAME tx;
    tx.id = 0x18DB33F1; // Functional request
    tx.extended = true;
    tx.rtr = 0;
    tx.length = 8;
    tx.data.uint8[0] = 0x02;
    tx.data.uint8[1] = service;
    tx.data.uint8[2] = pid;
    for (int i = 3; i < 8; i++)
        tx.data.uint8[i] = 0x00;
    return CAN0.sendFrame(tx);
}

bool OBD2Class::recv_pid_29(uint8_t expected_service_resp, uint8_t pid, uint8_t *outData, uint32_t timeout_ms)
{
    uint32_t start = millis();
    while ((millis() - start) < timeout_ms)
    {
        CAN_FRAME rx;
        if (CAN0.read(rx) != 0)
        {
            if (!rx.extended)
                continue;
            if (rx.length >= 3)
            {
                uint8_t svc = rx.data.uint8[1];
                uint8_t pid_rx = rx.data.uint8[2];
                if (svc == expected_service_resp && pid_rx == pid)
                {
                    for (int i = 0; i < rx.length; i++)
                    {
                        outData[i] = rx.data.uint8[i];
                    }
                    return true;
                }
            }
        }
    }
    return false;
}

