AthenasArch/ESP32S3-CAN-OBD2-Firmware/lib/AthenasArch-ESP32_OBD2/src/athenasObd2.cpp
// -----------------------------
// pidRead29 atualizado com mutex
// -----------------------------
bool OBD2Class::pidRead29(uint8_t pid, float &outVal)
{
    const uint8_t SERVICE = 0x01;
    const uint8_t SERVICE_RESP = 0x41;

    bool ok = false;

    if (xSemaphoreTake(_canMutex, pdMS_TO_TICKS(200)))  // protege acesso ao TWAI
    {
        if (send_pid_29(SERVICE, pid)) {
            uint8_t buf[8] = {0};
            if (recv_pid_29(SERVICE_RESP, pid, buf, 200)) {

                uint8_t AA = buf[3];
                uint8_t BB = buf[4];

                switch (pid)
                {
                case ENGINE_RPM:
                    outVal = (256.0f * AA + BB) / 4.0f;
                    ok = true;
                    break;
                case VEHICLE_SPEED:
                    outVal = AA;
                    ok = true;
                    break;
                case ENGINE_COOLANT_TEMPERATURE:
                case AIR_INTAKE_TEMPERATURE:
                    outVal = (int)AA - 40;
                    ok = true;
                    break;
                case INTAKE_MANIFOLD_ABSOLUTE_PRESSURE:
                    outVal = AA;
                    ok = true;
                    break;
                case THROTTLE_POSITION:
                case CALCULATED_ENGINE_LOAD:
                    outVal = (AA * 100.0f) / 255.0f;
                    ok = true;
                    break;
                case MAF_AIR_FLOW_RATE:
                    outVal = (256.0f * AA + BB) / 100.0f;
                    ok = true;
                    break;
                case TIMING_ADVANCE:
                    outVal = (AA / 2.0f) - 64.0f;
                    ok = true;
                    break;
                case FUEL_TANK_LEVEL_INPUT:
                    outVal = (AA * 100.0f) / 255.0f;
                    ok = true;
                    break;
                case PIDS_SUPPORT_01_20:
                    outVal = 1.0f;
                    ok = true;
                    break;
                }
            }
        }
        xSemaphoreGive(_canMutex);
    }

    return ok;
}
OBD2Class OBD2;
